HUMANS = ['Иванович Иван Леонидович', 'Бабушкин Мирон Русланович', 'Марков Пётр Даниилович',
            'Журавлева Вера Михайловна', 'Козлова Екатерина Данииловна', 'Ермакова Александра Георгиевна']

# Факультеты и кафедры
SyktGU = {
        'Институт гуманитарных наук':[
            'Кафедра философии и социально-политических наук',
            'Кафедра журналистики',
            'Кафедра связей с общественностью и рекламы',
            'Кафедра русской филологии',
            'Кафедра коми филологии, финноугроведения и регионоведения'
        ],
        'Институт естественных наук':[
            'Кафедра химии',
            'Кафедра геологии',
            'Кафедра биологии',
            'Кафедра экологии',
        ],
        'Институт иностранных языков':[
            'Кафедра иностранных языков',
            'Кафедра английского языка',
            'Кафедра немецкого и французского языков'
        ],
        'Институт истории и права':[
            'Кафедра истории России и зарубежных стран',
            'Кафедра истории и методики обучения общественно-правовым дисциплинам'
        ],
        'Институт культуры и искусства':[
            'Кафедра истории и методики обучения общественно-правовым дисциплинам',
            'Кафедра изобразительного искусства',
            'Кафедра дизайна.'
        ],
        'Медицинский институт':[
        'Кафедра фундаментальной медицины и общественного здоровья',
        'Кафедра биохимии и физиологии',
        'Кафедра неврологии, психиатрии и специальных клинических дисциплин',
        'Кафедра терапии',
        'Кафедра хирургии',
        'Кафедра педиатрии'
        ],
        'Институт экономики и управления':[
        'Кафедра финансового менеджмента',
        'Кафедра банковского дела',
        'Кафедра экономической теории и корпоративного управления',
        'Кафедра менеджмента и маркетинга'
        ]
}

# Список предметов
academic_subjects = ['Биология', 'История', 'Обществознание', 'Высшая математика', 'Информатика', 'Иностранный язык', 'Ботаника', 'Паразитология', 'Философия', 'Право', 'Физическая культура', 'Педагогика', 'Политология']

# Контактны данные и информация о человеке
HUMAN_DATE = {
                'имя': '',
                'др': '',
                'контакты': ['phone', 'mail', 'tg'],      
                'должность': '',
                'дополнительная информация': ''                
}