# ИСПОЛЬЗОВАТЬ везде: PEP 8 рекомендует для имён переменных использовать змеиный_нижний_регистр или слитныйнижнийрегистр
name = input('Введите имя: ')
last_name = input('Введите фамилию: ')
# ПЕРЕИМЕНОВАТЬ: age — возраст, год — year
age = input('Введите год рождения:')

print(name, last_name, age)


# ИСПОЛЬЗОВАТЬ везде: PEP 8 рекомендует добавлять пробелы после символа # — в большинстве редакторов кода, включая Notepad++, это делает команда "Вкл./Выкл. комментарий" или аналогичная
# УДАЛИТЬ: данный комментарий не соответствует вводу при выполнении программы
# Иван Петров 2004
# Петр Иванович 1987


# КОММЕНТАРИЙ: PEP 8 — сборник рекомендаций по стилистическому оформлению Python кода — их стоит использовать для большего удобства чтения своего и чужого кода: https://peps.python.org/pep-0008/

# КОММЕНТАРИЙ: этот ресурс поможет вам лучше придумывать имена переменным: https://context.reverso.net/перевод/русский-английский
